function output=smf_prop_ssf(input)

%=====================
% Ανάγνωση πίνακα εισόδου 
%=====================

nt=input(1); % μέγεθος χρονικού παραθύρου FFT, πρέπει nt=2^n
u0=input(2:nt+1); % δείγματα παλμού εισόδου (πεδίο όχι ισχύς), ορίζουμε τον παλμό έτσι ώστε μήκος παλμού εισόδου=nt
dt=input(nt+2); % χρονικό βήμα [ps], χρονικό παράθυρο FFT -> T=nt*dt
dz=input(nt+3); % μήκος απειροστού τμήματος κατά μήκος της ίνας [km]
nz=input(nt+4); % πλήθος απειροστών τμημάτων dz (L=nz*dz)
lamda0=input(nt+5);% κεντρικό μήκος κύματος [nm] 
alpha_indB=input(nt+6); % συντελεστής απωλειών σε dB
D=input(nt+7) % παράμετρος διασποράς [ps/nm.km]
%betam=input(nt+6:nt+9); % διάνυσμα παραμέτρων διασποράς (beta_0...beta_m) [ps^m/km]
n2=input(nt+8); % μη γραμμικός δείκτης διάθλασης [m^2/W] 
Aeff=input(nt+9); % ενεργός επιφάνεια [m^2]
P_NL_thres=input(nt+10); % Ισχύς πάνω από την οποία επιδρούν τα μη γραμμικά φαινόμενα [W]
maxiter=input(nt+11); % αριθμός επαναλήψεων (default=4)
tol=input(nt+12); % ανοχή σύγκλισης  (default=1e-5)
tic;

%========================
% Έξοδος
% u1- πεδίο στην έξοδο της ίνας
%========================

%=================================================================
% Παρακάτω επιλύεται η μη γραμμική εξίσωση Schrοedinger για διάδοση σε
% οπτική ίνα με χρήση της μεθόδου Split-Step Fourier 
% Περιλαμβάνονται τα ακόλουθα φαινόμενα: εξασθένηση, διασπορά ταχύτητας
% ομάδας και διασπορά ανώτερης τάξης καθώς αυτοδιαμόρφωση φάσης (SPM)
%=================================================================

alpha=alpha_indB/4.3429;   % Μετατροπή συντελεστή εξασθένησης από dB σε 1/km
c=3e8; % ταχυτητα του φωτός [m/s]
w0=10^9*((2*pi*c)/lamda0); % γωνιακή συχνότητα [rad/s]
beta0=0;
beta1=0;
beta2=10^3*( -(lamda0)^2*D/(2*pi*c));% GVD  [psec^2/km]
beta3=0; % διασπορά τρίτης τάξης [psec^3/km]
betam=[beta0 beta1 beta2 beta3];
gamma=1000*((w0*n2)/(c*Aeff)); % παράμετρος μη γραμμικότητας  [1/(km*W)]
ntt=length(u0);

w=2*pi*[(0:ntt/2-1),(-ntt/2:-1)]'/(dt*nt); % Ορισμός γωνιακών συχνοτήτων, SImulink
%w=2*pi*[(0:ntt/2-1),(-ntt/2:-1)]/(dt*nt); % m.file
clear halfstep

halfstep=-alpha/2; % Όρος απωλειών

for ii=0:length(betam)-1
    halfstep=halfstep+j*((-1)^ii)*betam(ii+1)*(w.^ii)/factorial(ii); %  Εισαγωγή όρου διασποράς στο γραμμικό τελεστή D(jw)=halfstep
end
clear Linear Operator
%================
% Γραμμικός τελεστής
%================
LinearOperator=halfstep;
halfstep=exp(halfstep*dz/2); %exp(D(jw)*dz/2)
u1=u0;
ufft=fft(u0); % μετασχηματισμός Fourier του παλμού εισόδου

%==============================================================
%Εισαγωγή μη γραμμικών φαινομένων
%Τα μη γραμμικά φαινόμενα θα προστεθoύν μόνο αν η ισχύς κορυφής είναι
%μεγαλύτερη από κατώφλι ισχύος P_NL_thres, η οποία υπολογίζεται μετά από
%κάθε βήμα κατά μήκος της ίνας
%===============================================================

iz=0;

while (iz<nz) & (max((abs(u1).^2+abs(u0).^2))>P_NL_thres)
    iz=iz+1;
    uhalf=ifft(halfstep.*ufft);   % IFFT(exp(D(jw)*dz/2)*FFT(u0))
    
    for ii=1:maxiter      % υπολογισμός μη γραμμικού τελεστή μέχρι να υπάρξει σύγκλιση     
        uv=uhalf.*exp(j*gamma*(abs(u1).^2+abs(u0).^2)*dz/2);  
        ufft=halfstep.*fft(uv); 
        uv=ifft(ufft);
        if (max(uv-u1)/max(u1)<tol)
            u1=uv;
            break;
        else
            u1=uv;
        end
    end
    if (ii==maxiter)
        warning(sprintf('Failed to converge to %f in %d iterations' , tol,maxiter));
    end
    u0=u1;
end

%==========================================================================
% περίπτωση όπου σε κάποιο σημείο ή και σε ολόκληρη την ίνα δεν υπάρχουν μη γραμμικά φαινόμενα
%τότε υπάρχει μόνο ο πρώτος και τρίτος όρος της σχέσης (2.41) και προκύπτει
%Α(z+dz, T)=exp(Ddz)
%==========================================================================

if (iz<nz) & (max((abs(u1).^2+abs(u0).^2))<P_NL_thres)  
    ufft==fft(u1);
    ufft=ufft.*exp(LinearOperator*(nz-iz)*dz);
    u1=ifft(ufft);
end
toc;
output=u1;
    
    
        
        
            


