% Προσομοίωση διάδοσης ενός συχνοτικού καναλιού σε μια μονότροπη ίνα 
%με κλήση της συνάρτησης smf_prop.m η οποία επιλύει την NLSE  με χρήση της  Split-Step Fourier μεθόδου 
clear all
%=============================================
% Ορισμός χρονικού παραθύρου
%=============================================
t_max = 2000;
dt = (2*t_max/2^12); % ορισμός χρονικού βήματος έτσι ώστε το μέγεθος του παλμού εισόδου να είναι δύναμη του 2 (length(u0)=length(t)=2^n)
t = (-t_max:dt:(t_max-dt));
%f=194*10^12;

%=============================================
% Oρισμός σήματος εισόδου (ένταση πεδίου) - Gaussian παλμός
%=============================================
P0 = 0.25;% [W] Ισχύς κορυφής
m=1;
C = 0;       % Παράμετρος chirping
t0=50 ; % [psec] Κέντρο του παλμού
Tfwhm =10; % [psec] Αρχικό εύρος μισής ισχύος του παλμού
T0 = Tfwhm/(2*(log(2))^0.5); % Σημείο 1/e της ισχύος κορυφής
%================================
% Πεδίο εισόδου στο πεδίο του χρόνου
%================================
bits = [1 1 1 1 0 0 1 0 0 0 1 0 1 1 0 0 1 1 1 0 ];
l=1;
for k=1:length(bits)
    l=1;
for t=0:dt:(t_max-dt)
   
    u(k,l)=bits(k)*sqrt(P0)*exp(-0.5*(1-i*C)*((t-(t0+100*k-100))./T0).^(2*m));
   
    
    l=l+1;
end
end
u0=0;
for k=1:length(bits)
    u0=abs(u0)+abs(u(k,:));
end
t = (0:dt:(t_max-dt));
%u0= sqrt(P0)*exp(-0.5*(1+j*C)*(((t-t0).^2./T0^2)));
%================================================
%Γραφική παράσταση του παλμού Gauss ως προς το χρόνο
%================================================
figure(1)
plot(t,1000*abs(u0.^2),'Linewidth',2) % P->mW
title('Παλμός στην είσοδο','fontsize',14)
ylabel('Pin (mW))','fontsize',14)
xlabel('t(psec)','fontsize',14)
grid on
%================================
% Πεδίο εισόδου στο πεδίο της συχνότητας
%================================
Efft=fft(u0);
Ef = fftshift(Efft); 
% Ορισμός των δειγμάτων συχνότητας 
fmax=1/dt;  
df=1/(length(Ef)*dt);
k=1:length(Ef);
F=-fmax/2+(k-1)*df;

%================================================
%Γραφική παράσταση του παλμού Gauss ως προς τη συχνότητα
%================================================

figure(2)
plot(F*1000,1000*(dt*abs(Ef)).^2,'Linewidth',2)
title('Φάσμα εισερχόμενου παλμού','fontsize',14) 
ylabel('|Pin(f)| (mW))','fontsize',14)
xlabel('F(GHz)','fontsize',14)
grid on

%=============================================
% Ορισμός φυσικών παραμέτρων και παραμέτρων της ίνας
%=============================================

c = 3e8; % [m/sec] ταχύτητα του φωτός
lamda0 = 1550;% [nm] κεντρικό μήκος κύματος
k0 = 2*pi/lamda0; % κυματάριθμος
n2 = 2.6e-20; % [m^2/W] μη γραμμικός δείκτης διάθλασης
Aeff=43.33*10^-12;  % [m^2] ενεργός επιφάνεια
alpha_indB =0.2; % [dB/km] Απώλειες ισχύος
 Dp =17;% [ps/nm.km]
 beta2=10^3*( -(lamda0)^2*Dp/(2*pi*c));% GVD  [psec^2/km]
Ld=T0^2/abs(beta2);


%=============================================
% Ορισμός μήκους των απειροστών τμημάτων (dz) και του μήκους της ίνας (L=nz*dz)
%=============================================

dz=0.01; %  [km] μήκος απειροστού τμήματος κατά μήκος της ίνας
for nz=[1000]
%for nz=[0 Ld*100 2*Ld*100 3*Ld*100  4*Ld*100 5*Ld*100]  % αριθμός απειροστών τμημάτων dz
maxiter=4;
tol=1e-5;
P_non_thres=0.005; %[W]
nt=length(u0); % μέγεθος χρονικού παραθύρου FFT

%===========================================
%Ορισμός πίνακα εισόδου της συνάρτησης smf_prop.m
%===========================================

in=[nt u0 dt dz nz lamda0 alpha_indB Dp n2 Aeff P_non_thres maxiter tol ];

%================================================%
%Διάδοση στην ίνα - Κλήση της συνάρτησης smf_prop.m
%================================================%

u2=smf_prop_ssf(in); % Πεδίο στην έξοδο της ίνας

%================================================
%Γραφική παράσταση του παλμού εξόδου ως προς το χρόνο
%================================================
figure(3)
plot(t,1000*abs(u2.^2),'Linewidth',2)
title('Παλμός στην έξοδο','fontsize',14)
ylabel('Pout (mW))','fontsize',14)
xlabel('t(psec)','fontsize',14)
grid on
hold on

%================================================
%Γραφική παράσταση του παλμού εξόδου ως προς το χρόνο
%================================================

Efft2=fft(u2);
Ef2 = fftshift(Efft2);
figure(4)
plot(F*1000,1000*(dt*abs(Ef2)).^2,'Linewidth',2)
title('Φάσμα εξερχόμενου παλμού','fontsize',14) 
%ylabel('|Pout(f)|(mW))','fontsize',14)
ylabel('Normalized Intensity','fontsize',14)
xlabel('F(GHz)','fontsize',14)
grid on
hold on 
end

